[
  {
    "displayName": "A vulnerability assessment solution should be enabled on your virtual machines",
    "description": "Audits virtual machines to detect whether they are running a supported vulnerability assessment solution. A core component of every cyber risk and security program is the identification and analysis of vulnerabilities. Azure Security Center's standard pricing tier includes vulnerability scanning for your virtual machines at no extra cost. Additionally, Security Center can automatically deploy this tool for you.",
    "id": "/providers/Microsoft.Authorization/policyDefinitions/501541f7-f7e7-4cd6-868c-4190fdad3ac9",
    "name": "501541f7-f7e7-4cd6-868c-4190fdad3ac9"
  },
  {
    "displayName": "Monitor missing Endpoint Protection in Azure Security Center",
    "description": "Servers without an installed Endpoint Protection agent will be monitored by Azure Security Center as recommendations",
    "id": "/providers/Microsoft.Authorization/policyDefinitions/af6cd1bd-1635-48cb-bde7-5b15693900b9",
    "name": "af6cd1bd-1635-48cb-bde7-5b15693900b9"
  },
  {
    "displayName": "SQL databases should have vulnerability findings resolved",
    "description": "Monitor vulnerability assessment scan results and recommendations for how to remediate database vulnerabilities.",
    "id": "/providers/Microsoft.Authorization/policyDefinitions/feedbf84-6b99-488c-acc2-71c829aa5ffc",
    "name": "feedbf84-6b99-488c-acc2-71c829aa5ffc"
  },
  {
    "displayName": "System updates should be installed on your machines",
    "description": "Missing security system updates on your servers will be monitored by Azure Security Center as recommendations",
    "id": "/providers/Microsoft.Authorization/policyDefinitions/86b3d65f-7626-441e-b690-81a8b71cff60",
    "name": "86b3d65f-7626-441e-b690-81a8b71cff60"
  },
  {
    "displayName": "Vulnerabilities in security configuration on your machines should be remediated",
    "description": "Servers which do not satisfy the configured baseline will be monitored by Azure Security Center as recommendations",
    "id": "/providers/Microsoft.Authorization/policyDefinitions/e1e5fd5d-3e4c-4ce1-8661-7d1873ae6b15",
    "name": "e1e5fd5d-3e4c-4ce1-8661-7d1873ae6b15"
  }
]